import 'package:carousel_slider/carousel_slider.dart';
//carousel_slider: ^4.2.1
import 'package:flutter/material.dart';

class Home extends StatefulWidget {
  const Home({super.key});

  @override
  State<Home> createState() => _HomeState();
}

class _HomeState extends State<Home> {
  @override
  Widget build(BuildContext context) => Scaffold(
        appBar: AppBar(
          leading: IconButton(
            onPressed: () {},
            icon: Icon(
              Icons.account_circle_outlined,
              size: 40,
            ),
          ),
          title: const Text('หน้าหลัก'),
        ),
        body: Container(
          padding: const EdgeInsets.only(bottom: 0),
          color: Colors.grey.withOpacity(.1),
          child: ListView(
            children: [
              logo(),
              event(),
              image(),
              SizedBox(
                height: 50,
              ),
              contact(),
              SizedBox(
                height: 50,
              ),
              content(),
              SizedBox(
                height: 50,
              ),
            ],
          ),
        ),
      );
}

class event extends StatelessWidget {
  const event({super.key});

  @override
  Widget build(BuildContext context) {
    return Container(
      height: 100,
      width: double.infinity,
      child: Text('โฆษณากิจกรรม'),
    );
  }
}

class logo extends StatefulWidget {
  const logo({super.key});

  @override
  State<logo> createState() => _logoState();
}

class _logoState extends State<logo> {
  @override
  Widget build(BuildContext context) {
    return Container(
      color: Colors.blue,
      padding: const EdgeInsets.fromLTRB(30, 50, 30, 50),
      child: Container(
        padding: const EdgeInsets.all(20),
        decoration: BoxDecoration(
            color: Colors.lightBlue, border: Border.all(color: Colors.white)),
        child: Image.asset(
          'lib/images/med1.png',
          fit: BoxFit.cover,
          width: 500,
        ),
      ),
    );
  }
}

class image extends StatefulWidget {
  const image({super.key});

  @override
  State<image> createState() => _imageState();
}

class _imageState extends State<image> {
  Widget buildImage(String urlImage, int index) => Container(
        color: Color.fromARGB(255, 127, 193, 255),
        child: Image(image: AssetImage(urlImage)),
      );
  int currentPos = 0;


  ////////////////รูปสไลด์ เพิ่มหรือลบในลิสต์นี้ได้เลยครับ
  final urlImages = [
    'lib/images/med1.png',
  ];
  @override
  Widget build(BuildContext context) {
    return Column(
      children: [
        CarouselSlider.builder(
          itemCount: urlImages.length,
          itemBuilder: ((context, index, realIndex) {
            final urlImage = urlImages[index];
            return buildImage(urlImage, index);
          }),
          options: CarouselOptions(
            // onPageChanged: ,
            onPageChanged: (index, reason) {
              setState(() {
                currentPos = index;
              });
            },

            autoPlay: false,
            // enlargeCenterPage: true,
            height: 250,
            viewportFraction: 1,
          ),
        ),
        Row(
          mainAxisAlignment: MainAxisAlignment.center,
          children: urlImages.map((url) {
            int index = urlImages.indexOf(url);
            return Container(
              margin: const EdgeInsets.all(5),
              width: 25.0,
              height: 10.0,
              decoration: BoxDecoration(
                shape: BoxShape.circle,
                color: currentPos == index
                    ? Color.fromRGBO(0, 94, 255, 0.878)
                    : Color.fromRGBO(98, 118, 170, 0.4),
              ),
            );
          }).toList(),
        ),
      ],
    );
  }
}

class contact extends StatefulWidget {
  const contact({super.key});

  @override
  State<contact> createState() => _contactState();
}

class _contactState extends State<contact> {
  @override
  Widget build(BuildContext context) {
    return Card(
      child: Container(
        margin: const EdgeInsets.fromLTRB(0, 10, 0, 10),
        child: Row(
          mainAxisAlignment: MainAxisAlignment.center,
          crossAxisAlignment: CrossAxisAlignment.center,
          children: [
            Container(
              margin: const EdgeInsets.only(left: 15),
              child: Text(
                '"ปรึกษาเภสัชกร"\nตลอด 24 ชม.',
                style: TextStyle(
                    fontSize: 20,
                    color: Colors.blue,
                    fontWeight: FontWeight.bold),
                textAlign: TextAlign.center,
              ),
            ),
            Container(
              width: 1,
              height: 50,
              color: Colors.grey,
              margin: const EdgeInsets.only(right: 20, left: 20),
            ),
            Container(
              child: Column(
                mainAxisAlignment: MainAxisAlignment.spaceBetween,
                children: [
                  Row(
                    children: [
                      Text(
                        'ติดต่อเราได้ที่ :',
                        style: TextStyle(
                            fontSize: 16,
                            color: Colors.blue,
                            fontWeight: FontWeight.bold),
                        textAlign: TextAlign.center,
                      ),
                      Container(
                          margin: const EdgeInsets.fromLTRB(3, 0, 3, 0),
                          child: Image(
                            image: AssetImage('lib/images/line.png'),
                            width: 20,
                          )),
                      Container(
                          margin: const EdgeInsets.fromLTRB(3, 0, 3, 0),
                          child: Image(
                            image: AssetImage('lib/images/facebook.png'),
                            width: 20,
                          )),
                    ],
                  ),
                  Container(
                    margin: const EdgeInsets.only(top: 10),
                    padding: const EdgeInsets.only(right: 5),
                    decoration: BoxDecoration(
                      color: Colors.blue,
                      borderRadius: BorderRadius.circular(50),
                    ),
                    child: Row(
                      children: [
                        Container(
                          margin: const EdgeInsets.all(5),
                          decoration: BoxDecoration(
                            color: Colors.white,
                            borderRadius: BorderRadius.circular(50),
                          ),
                          padding: const EdgeInsets.all(5),
                          child: Icon(
                            Icons.call,
                            size: 18,
                            color: Colors.blue,
                          ),
                        ),
                        Text(
                          'โทร 080-598-1093',
                          style: TextStyle(color: Colors.white, fontSize: 15),
                        )
                      ],
                    ),
                  ),
                ],
              ),
            )
          ],
        ),
      ),
    );
  }
}

class content extends StatefulWidget {
  const content({super.key});

  @override
  State<content> createState() => _contentState();
}

class _contentState extends State<content> {
  @override
  Widget build(BuildContext context) {
    return Column(
      crossAxisAlignment: CrossAxisAlignment.start,
      children: [
        Container(
            margin: const EdgeInsets.only(left: 20),
            child: Text(
              'บทความแนะนำ',
              style: TextStyle(
                  color: Colors.blue,
                  fontWeight: FontWeight.bold,
                  fontSize: 25),
            )),
        CT()
      ],
    );
  }
}

//////////////บทความ เพิ่มหรือลบในลิสต์นี้ได้เลยครับ
 var contents = [
    const Content(
        img: 'lib/images/Content1.png',
        title: 'สารสำคัญในกัญชา',
        txt: 'ปัจจุบันพบสารที่เป็นองค์ประกอบของกัญชาทั้งหมด 565 ชนิด ข้อมูลจาก 2015 แบ่งออกเป็น 3 กลุ่มหลักๆ ได้แก่ กลุ่มแคนาบินอยด์, กลุ่มเทอร์ปีน, กลุ่มฟลาโวนอยด์\n\n1 กลุ่มแคนนาบินอยด์แคนนาบินอยด์มีมากกว่า 100 ชนิด สำหรับพืชพบได้ในกัญชาเท่านั้น เรียกสารแคนาบินอยด์ที่ได้จากกัญชาว่า "ไฟโตแคนนาบินอยด์" เพื่อไม่ให้สับสนระหว่างสารแคนาบินอยด์ที่ร่างกายมนุษย์สร้างขึ้นหลายคนอาจจะสงสัยว่ากัญชาสามารถสร้างสารแคนาบินอยด์ที่เหมือนกับสารที่ร่างกายสร้างขึ้นได้ด้วยหรอ คำตอบคือเกือบเหมือนค่ะ แต่ใช้แทนกันได้ โดยโครงสร้างทางเคมีของสารไฟโตแคคนาบินอยด์จากกัญชาคล้ายกับโครงสร้างทางเคมีของสารแคนนาบินอยด์ที่ร่างกายสร้างขึ้นเพื่อใช้งานในระบบการทำงานของร่างกายที่เรียกว่า ระบบเอ็นโดแคนนาบินอยด์ Endocannabinoid System (ESC) ระบบเอ็นโดแคนนาบินอยด์ คือระบบการรักษาความสมดุลของร่างกายให้ทำงานเป็นปกติ โดยการควบคุมการทำงานของระบบต่างๆ ทั้งระบบประสาท กระบวนการทางกายภาพ การตอบสนองต่อความเจ็บปวด ความอยากอาหาร การย่อยอาหาร อารมณ์ การอักเสบต่างๆ ระบบภุมิคุ้มกัน ระบบประสาทสัมผัส การทำงานของหัวใจและอื่นๆ ระบบต่างๆที่กล่าวมาจะถูกควบคุมด้วยระบบเอ็นโดแคนนาบินอยด์ หากร่างกายมนุษย์ไม่สามารถสร้างสารแคนาบินอยด์ได้ หรือสร้างได้น้อย ร่างกายจะเกิดอาการผิดปกติ อาจเกิดโรคต่างๆขึ้นได้ การใช้สารแคนาบินอยด์ที่ได้จากกัญชาไปทดแทน จึงช่วยรักษาและป้องกันโรคที่เกิดจากากรบกพร่องของสารแคนาบินอยด์ได้ ในบทความต่อไปจะมาขยายความถึงกระบวนการทำงานของสารแคนนาบินอยด์ให้ผู้อ่านนะคะ ตอนนี้ขอต่อหัวข้อสารในกลุ่มแคนาบินอยด์กันก่อนค่ะ แคนาบินอยด์ (Cannabinoids) เป็นสารสำคัญในกัญชา ตัวที่รู้จักและมีการศึกษาวิจัยมากในปัจจุบันได้แก่สาร THC, CBD, CBG, CBC, CBN  โดยสารที่ได้รับความนิยมมากที่สุดได้แก่ สารเดลต้า 9 เตตร้าไฮโดรแคนนาบินอยด์ (THC) และ แคนนาบิไดออล (CBD) ความแตกต่างระหว่างสาร THC และ CBD สารTHC และ CBD มีความคล้ายคลึงกันมาก นอกจากจะอยู่ในกลุ่มแคนาบินอยด์เหมือนกันแล้วยังมีส่วนประกอบอะตอมที่เท่ากันอีก THCและCBDประกอบด้วย คาร์บอน 21 อะตอม ไฮโดรเจน 30 อะตอม และออกซิเจน 2 อะตอม  แต่สิ่งที่ต่างกันคือการเรียงตัวของอะตอม ส่งผลให้ออกฤทธิ์ต่อระบบภายในร่างกายต่างกันไปด้วย โดยความแตกต่างที่ชัดเจนคือ THC เป็นสารที่ออกฤทธิ์ทางประสาท ทำให้ผู้ใช้เกิดอาการเมา หรือ “High” ในขณะที่ CBD จะไม่ส่งผลทางระบบประสาทโดยตรง ทำให้ผู้ใช้ไม่เกิดอาการเมา ที่เป็นแบบนี้เพราะสารทั้งสองชนิดทำงานกับตัวรับแคนนาบินอยด์ในร่างกายเราแตกต่างกัน ตัวรับแคคนาบินอยด์ที่ว่านี้เป็นสิ่งที่มีอยู่ในร่างกายมนุษย์อยู่แล้วตามธรรมชาติ ตัวรับแคนนาบินอยด์สามารถแบ่งออกได้เป็น 2 ประเภท ได้แก่ CB1 และ CB2 โดยตัวรับแคนนาบินอยด์ CB1 จะอยู่ที่ระบบประสาทส่วนกลาง ในขณะที่ตัวรับแคนนาบินอยด์ CB2 จะอยู่ที่ระบบประสาทส่วนปลาย เจ้าตัวรับแคนนาบินอยด์ CB1 ที่ระบบประสาทส่วนกลางนี่เองที่ตอบสนองต่อสาร THC ทำให้เกิดอาการเมา หรือ high นอกจากนี้เอนไซม์ในร่างกายของมนุษย์ยังสลายสาร THC ได้ยากกว่า CBD จึงทำให้อาการเมานั้นอยู่ได้นานตามปริมาณ THC ที่ยังค้างอยู่ในร่างกาย สิ่งที่แตกต่างกันอย่างเห็นได้ชัดระหว่าง 2 ชนิดนี้คือ “ความรู้สึก”ที่เกิดขึ้นเมื่อได้รับสารทั้งคู่เข้าไป\n\nTHC สาร Tetrahydrocannabinol (THC) ในขนาดที่เหมาะสม จะออกฤทธิ์ ลดอาการปวด เกร็ง ของกล้ามเนื้อ ลดอาการเคลื่อนไส้ถ้าหากได้รับในปริมาณสูง จะออกฤทธิ์ ทำให้เมา ใจสั่น หน้ามืด เห็นภาพหลอน รบกวนการทำงานของสารเคมีในสมอง ทำให้การรับรู้เพี้ยน การตัดสินใจและมีผลต่อความจำ หากได้รับในปริมาณที่สูงอย่างต่อเนื่อง จะ  ทำให้เกิดภาวะการดื้อต่อสาร Tolerance ทำให้ต้องเพิ่มขนาดจึงจะได้ผลเท่าเดิมและเกิดการติดยาต่อเนื่องได้\n\nCBD สาร Cannabidiol (CBD) เป็นสารที่มีฤทธิ์ช่วยอาการเมาเคลื้ม และแก้อาการทางจิตจากสาร THC (Tetrahydrocannabinol) ได้ นอกจากนี้ สาร Cannabidiol (CBD) มีการศึกษา วิจัยเกี่ยวกับการใช้ CBD เพื่อควบคุม อาการชัก อาการปวด แต่ยังไม่พบว่าทำให้เกิดอาการดื้อยาหรือติดยาได้\n\nCBC CBC เป็นอีกหนึ่ง cannabinoid ที่ไม่ออกฤทธิ์ต่อจิตประสาทซึ่งแม้จะมีการค้นพบในทศวรรษที่ 1960 แต่ก็ยังไม่ได้รับการศึกษาอย่างละเอียด มีงานศึกษาบางตัวที่ชี้ว่า CBC เพิ่มคุณสมบัติในการบรรเทาอาการปวดของ THC และอาจมีคุณสมบัติในการต้านอาการซึมเศร้าที่มีประสิทธิภาพมากกว่า CBD นอกจากนี้ยังเกี่ยวข้องกับการรักษาอาการคลื่นไส้อาเจียน เป็นเรื่องของการศึกษาทางการแพทย์ต่อไป\n\nCBG CBG เป็น cannabinoid ที่มีจำนวนน้อยมาก แต่มีประโยชน์ต่อการรักษาปัญหาที่เกี่ยวข้องกับโรคต้อหิน ภาวะซึมเศร้า และการบรรเทาอาการปวด รวมถึงมีส่วนเสริมความชุ่มชื้นให้ผิวตามธรรมชาติ CBD เป็นสารตั้งต้นทางเคมีให้กับ cannabinoids อื่น ๆ เช่น CBD และ THC เนื่องจากผ่านกระบวนแปรเคมีระหว่างการเจริญเติบโตของพืช ด้วยเหตุนี้จึงมักมีความสัมพันธ์ผกผันระหว่าง CBG ระดับสูงและ THC ระดับต่ำ CBG ไม่ทำให้มึนเมา CBG ถูกค้นพบว่ามีประสิทธิภาพในการรักษาโรคต้อหินเนื่องจากช่วยลดความดันในลูกตา เป็นยาขยายหลอดเลือด และมีฤทธิ์ป้องกันระบบประสาท ในการทดลองพบว่า CBG มีประสิทธิภาพในการลดลักษณะการอักเสบของโรคลำไส้อักเสบ และ สามารถปกป้องเซลล์ประสาทในหนูที่เป็นโรคฮันติงตันซึ่งมีลักษณะการเสื่อมของเซลล์ประสาทในสมอง รวมถึงมีผลวิจัยเบื้องต้นที่บ่งชี้ว่า CBG อาจสามารถยับยั้งการเติบโตของเซลล์มะเร็งลำไส้ใหญ่และทวารหนัก\n\nCBN สารประกอบสำคัญที่มีผลการทำงานเป็นยาช่วยในการนอนหลับ cannabinol มีอยู่เป็นสัดส่วนน้อย และพร้อมใช้งานน้อยกว่า CBD หรือ THC แม้ว่าจะเป็นหนึ่งใน cannabinoids แรกที่ถูกค้นพบ CBN ผลิตขึ้นเมื่อ THC ถูกออกซิไดซ์ซึ่งเป็นสาเหตุที่ทำให้ดอกกัญชาแห้งที่สัมผัสกับออกซิเจนสามารถเป็นแหล่งที่ดีสำหรับการสกัด CBN นอกเหนือจากการเป็นตัวช่วยในการนอนหลับที่มีประสิทธิภาพแล้ว CBN ยังร่วมกับ CBD และ THC ในคุณสมบัติต้านการอักเสบที่มีประสิทธิภาพ การบรรเทาอาการซึมเศร้า และภาวะทางระบบประสาทเช่นโรคลมชักและอัลไซเมอร์ \n\n'),
    const Content(
        img: 'lib/images/Content2.png',
        title: 'สายพันธุ์กัญชาหลัก และ 4 อัตลักษณ์กัญชาสายพันธุ์ไทย',
        txt: 'กัญชาเป็นพืชสกุล Cannabis จัดอยู่ในวงศ์ Cannabaceae \n\n3 สายพันธุ์หลักที่พบบ่อย ได้แก่ สายพันธุ์ซาติวา (Cannabis sativa) สายพันธุ์อินดิกา (Cannabis indica) สายพันธุ์รูเดอราลิส (Cannabis ruderalis)\n\nซาติว่า (Sativa)\nถิ่นกำเนิด พบได้ทั่วไปในสภาพอากาศร้อนและแห้ง มีแสงแดดจัดเป็นเวลานาน มักพบได้ใน แอฟฟริกา อเมริกากลาง เอเชียตะวันออกเฉียงใต้และบางส่วนของเอเชียตะวันตก ลักษณะสายพันธุ์ ลำต้นสูงผอม ใบยาวลักษณะใบเหมือนนิ้วมือ สามารถเจริญเติบโตได้สูงกว่า 3-5 เมตร และใช้เวลานานกว่าจะโตเต็มที่เมื่อเทียบกับสายพันธุ์อื่นๆ อัตราส่วนสารสำคัญ โดยทั่วไปมักจะมีสาร CBD ต่ำ และมี สาร THC สูง การออกฤทธิ์ มักออกฤทธิ์ตื่นตัว กระปรี้กระเปร่า เพิ่มโฟกัส ช่วยคลายเครียด ช่วงเวลาที่เหมาะสมต่อการใช้งาน ควรใช้สายพันธุ์ซาติว่าในช่วงเวลากลางวัน เนื่องจากเป็นการออกฤทธิ์ที่ทำให้ตื่นตัว\n\nอินดิก้า (Indica)\nถิ่นกำเนิด พบในอัฟกานิสถาน อินเดีย ปากีสถาน และตุรกี กัญชาสายพันธุ์อินดิก้าได้ปรับตัวให้เข้ากับสภาพอากาศที่แห้งแล้งและปั่นป่วนของภูเขาฮินดูกูช (Hindu Kush Mountains) ลักษณะสายพันธุ์ ลำต้นเตี้ยตัน มีใบลักษณะอ้วนหนาและกว้าง เติบโตได้เร็วกว่ากัญชาสายพันธุ์ซาติว่า อัตราส่วนสารสำคัญ โดยทั่วไปมักจะมีสาร CBD สูง และมี สาร THC ต่ำหรือสูงได้เช่นกัน การออกฤทธิ์ มักออกฤทธิ์ผ่อนคลาย เพิ่มความอยากอาหาร ลดอาการปวดและคลื่นไส้อาเจียน ช่วงเวลาที่เหมาะสมต่อการใช้งาน ควรใช้สายพันธุ์อินดิก้าในช่วงเวลากลางคืน เนื่องจากเป็นการออกฤทธิ์ที่ทำให้ผ่อนคลาย\n\nรูเดราลิส (Ruderalis)\nกัญชาสายพันธุ์รูเดราลิสเป็นกัญชาสายพันธุ์ที่คนทั่วไปไม่ค่อยรู้จักเนื่องจากไม่เป็นที่นิยมและไม่มีสารมากพอที่จะออกฤทธิ์ใดๆ ถิ่นกำเนิด กัญชาสายพันธุ์รูเดราลิสเกิดจากการปรับตัวให้เข้ากับสภาพอากาศที่โหดร้าย พบในยุโรปตะวันออก บริเวณหิมาลัยของอินเดีย ไซบีเรีย และรัสเซีย ลักษณะสายพันธุ์รูเดราลิสเติบโตอย่างรวดเร็วเหมาะสำหรับสภาพแวดล้อมที่หนาวเย็นและมีแสงแดดน้อย ลำต้นมักสูงไม่เกิน 12 นิ้ว อัตราส่วนสารสำคัญ โดยทั่วไปมักจะมีสาร CBD สูงกว่าสาร THC แต่มีปริมาณน้อยจึงไม่ออกฤทธิ์ใดๆ นักปลูกมักจะนำสายพันธุ์รูเดราลิสผสมเข้ากับสายพันธุ์อื่นๆเพื่อให้ได้กัญชาที่สามารถเจริญเติบโตได้อย่างรวดเร็ว\n\n4 อัตลักษณ์กัญชาสายพันธุ์ไทย\n กัญชา 4 สายพันธุ์ไทยนี้เป็นกัญชาสายพันธุ์ซาติวา (Sativa) จากการศึกษาพบว่า กัญชาสายพันธุ์ไทย นั้นมีลักษณะเด่น 3 แบบ คือแบบที่ 1 กัญชาที่ให้สารTHC สูง ได้แก่ พันธุ์หางเสือสกลนครทีที 1, พันธุ์ตะนาวศรีก้านขาวดับเบิ้ลยูเอ 1แบบที่ 2 ให้สาร THC และ CBD ในสัดส่วนที่เท่ากัน ได้แก่ พันธุ์หางกระรอกภูพานเอสที 1 แบบที่ 3 ให้สาร CBD สูง ได้แก่ พันธุ์ตะนาวศรีก้านแดงอาร์ดี 1\n\nแบบที่ 1 กัญชาที่ให้สารTHC สูง ได้แก่ พันธุ์หางเสือสกลนครทีที 1, พันธุ์ตะนาวศรีก้านขาวดับเบิ้ลยูเอ 1\nพันธุ์หางเสือสกลนครทีที 1 ...สถาบันวิจัยสมุนไพร กรมวิทยาศาสตร์การแพทย์ ร่วมกับภาควิชาพฤกษศาสตร์ คณะวิทยาศาสตร์ มหาวิทยาลัยมหิดล และมทร.อีสาน วิทยาเขตสกลนคร ได้ทำการคัดเลือกต้นพันธุ์ของกัญชาพันธุ์หางเสือสกลนครจากเมล็ดพันธุ์ที่ได้ โดยการปลูกและคัดเลือกจำนวน 3 รุ่น โดยได้ทำการศึกษาลักษณะสัณฐานวิทยา (Morphology) ลักษณะทางด้านเคมี (chemical profile) และลักษณะทางด้านพันธุกรรม (genetic profile) เพื่อใช้ในการคัดเลือกพันธุ์กัญชาหางเสือสกลนคร รวมถึงข้อมูลการสำรวจการปลูกกัญชาในพื้นที่ต่างๆ ที่ได้กล่าวมาข้างต้น จากการศึกษาการปลูกทั้งสามรุ่นพบว่าลักษณะทางพันธุกรรมในกลุ่มยีนที่เกี่ยวข้องกับการสร้างสาร Tetrahydrocannabinol (THC) และ Cannabidiol (CBD) เช่น Tetrahydrocannabinolic Acid Synthase (THCAS) และ Cannabidiolic Acid Synthase (CBDAS) รวมความยาว 3.2 Megabase พบว่ากัญชาพันธุ์หางเสือสกลนครที่ได้รับการคัดเลือกนั้นจัดเป็นกัญชา type 1 หรือ chemotype 1 ซึ่งเป็นพันธุ์ที่มีการสร้างสาร THC ที่เด่น นอกจากนี้ได้ทำการศึกษาค่า Heterozygosity ของพันธุ์กัญชาโดยการเปรียบเทียบข้อมูลจากการศึกษากลุ่มยีน THCAS และ CBDAS พบว่าการแปรผันทางพัธุกรรมของกัญชาพันธุ์นี้ค่อนข้างต่ำเมื่อเทียบกับข้อมูลของกัญชาพันธุ์อื่นๆ ในฐานข้อมูล ดังนั้นรุ่นลูกจะมีการแปรผันทางพันธุกรรมที่ต่ำ และมีโอกาสในการแสดงออกทางด้านเคมีในการสร้างสาร THC คงที่ จากข้อมูลทางพันธุกรรมที่ได้นำมาเปรียบเทียบกับข้อมูลของปริมาณสาร THC และ CBD ทางด้าน Chemotype พบว่าพันธุ์หางเสือสกลนครมีปริมาณสาร ∆9 -THC สูง ซึ่งตรงกับลักษณะของ genotype ที่ได้ทำการศึกษาโดยมีปริมาณสาร ∆9-THC เฉลี่ยที่ 5.03±0.36 %W/W และมี CBD เฉลี่ยที่ 0.01±0.003 %W/W ตามประวัติพบการกระจายตัวของกัญชาพันธุ์หางเสือสกลนครพบได้ทั่วไปในประเทศไทย โดยเฉพาะในเขตภาคเหนือ และภาคตะวันออกเฉียงเหนือของประเทศไทย ซึ่งในเขตพื้นที่จังหวัดสกลนครนอกจากจะพบพันธุ์กัญชาหางกระรอกแล้วยังพบการกระจายตัวของกัญชาพันธุ์หางเสือสกลนครอีกด้วย ลักษณะเด่นของกัญชาพันธุ์หางเสือสกลนครทีที 1 นอกจากจะเด่นเรื่องสารสำคัญแล้ว ยังมีช่อดอกและกลิ่นที่เฉพาะตัวอีกด้วย คือ มีช่อดอกที่ยาว เป็นพวงยาวคล้ายหางเสือ มีกลิ่นเฉพาะตัวหอมคล้ายเปลือกส้ม มีกลิ่นฉุนเล็กน้อย\nพันธุ์ตะนาวศรีก้านขาวดับเบิ้ลยูเอ 1 ... จากการศึกษาค่า Heterozygosity ของพันธุ์กัญชาโดยการเปรียบเทียบข้อมูลจากการศึกษากลุ่มยีน THCAS และ CBDAS พบว่าความแปรผันทางพันธุกรรมของกัญชาพันธุ์นี้ค่อนข้างต่ำเมื่อเทียบกับข้อมูลของกัญชาพันธุ์อื่นๆ ในฐานข้อมูล ดังนั้นรุ่นลูกจะมีความแปรผันทางพันธุกรรมที่ต่ำ และมีโอกาสในการแสดงออกทางด้านเคมีในการสร้างสาร THC คงที่ จากข้อมูลทางพันธุกรรมที่ได้นำมาเปรียบเทียบกับข้อมูลของปริมาณสาร THC และ CBD ทางด้าน Chemotype พบว่าพันธุ์ตะนาวศรีก้านขาวมีการสร้างสารที่ตรงกับ genotype คือมีปริมาณสาร ∆9-THC สูง เฉลี่ยที่ 8.38±0.55 %W/W ส่วนปริมาณสาร CBD เฉลี่ยที่ 0.01±0.003 %W/W\nตามประวัติพบการแพร่กระจายในแถบเทือกเขาตะนาวศรี ซึ่งเป็นแนวต่อเนื่องจากเทือกเขาถนนธงชัย เป็นพรมแดนกั้นระหว่างไทยกับสหภาพเมียนมาร์ เริ่มตั้งแต่จังหวัดกาญจนบุรีลงไปทางใต้ ผ่านจังหวัดราชบุรี เพชรบุรี ประจวบคีรีขันธ์ และชุมพร มีความยาวประมาณ 834 กิโลเมตร จากข้อมูลที่ได้จากการสอบถามปราชญ์ชาวบ้าน หรือหมอพื้นบ้านในแถบเทือกเขาตะนาวศรี และเทือกเขาถนนธงชัย ในจังหวัดกาญจนบุรี ตาก และเลยไปถึงทางภาคใต้ของประเทศไทยเพื่อใช้เป็นข้อมูลในการแยกความแตกต่างจากกัญชาพันธุ์หางเสือซึ่งมีลักษณะที่คล้างคลึงกัน จากข้อมูลที่ได้ พบว่าลักษณะเด่นของกัญชาพันธุ์ตะนาวศรีก้านขาวดับเบิ้ลยูเอ 1 นอกจากจะมีค่า THC สูงแล้ว ยังมีลักษณะของช่อดอกและกลิ่นที่เฉพาะตัว คือมีทรงต้นที่พุ่ม ช่อดอกที่กระจุกแน่นที่ปลายกิ่ง มีช่อดอกจำนวนมาก และมีกลิ่นหอมคล้ายเปลือกส้มผสมกลิ่นตะไคร้ มีกลิ่นฉุนน้อยกว่ากัญชาพันธุ์หางเสือ\n\nแบบที่ 2 ให้สาร THC และ CBD ในสัดส่วนที่เท่ากัน ได้แก่ พันธุ์หางกระรอกภูพานเอสที 1\nพันธุ์หางกระรอกภูพานเอสที 1 ... จากการศึกษาค่า Heterozygosity ของพันธุ์กัญชาโดยการเปรียบเทียบข้อมูลของกลุ่มยีน THCAS และ CBDAS พบว่าความแปรผันทางพันธุกรรมของกัญชาพันธุ์นี้ค่อนข้างต่ำเมื่อเทียบกับข้อมูลของกัญชาพันธุ์อื่นๆ ในฐานข้อมูล ดังนั้นรุ่นลูกจะมีความแปรผันทางพันธุกรรมที่ต่ำ และมีโอกาสในการแสดงออกทางด้านเคมีในการสร้างสาร THC และ CBD คงที่ จากข้อมูลทางพันธุกรรมที่ได้ นำมาเปรียบเทียบกับข้อมูลของปริมาณสาร THC และ CBD ทางด้าน Chemotype พบว่าพันธุ์ หางกระรอกภูพาน มีปริมาณสาร THC:CBD ที่ ใกล้เคียงกัน ซึ่งตรงกับข้อมูลของ genotype โดยมีปริมาณสาร ∆ 9-THC เฉลี่ยที่ 6.06±0.43 %W/W และ CBD เฉลี่ยที่ 6.54±0.28 %W/W หรือ THC:CBD เท่ากับ 1:1\nตามประวัติพบการกระจายตัวของกัญชาพันธุ์ หางกระรอกภูพานบริเวณแถบเทือกเขาภูพานที่ตั้งอยู่ในจังหวัดสกลนครและจังหวัดกาฬสินธุ์ โดยเฉพาะในเขตจังหวัดสกลนครซึ่งมี การกล่าวถึงกัญชาพันธุ์นี้กันอย่างแพร่หลาย จากข้อมูลที่ได้ พบว่าลักษณะเด่นของกัญชาพันธุ์หางกระรอกภูพานเอสที1 นั้นมีลักษณะของช่อดอกและกลิ่นที่เฉพาะตัว คือ มีช่อดอกใหญ่เป็นพวงคล้ายหางกระรอก และมีกลิ่นหอมคล้ายมะม่วงสุก ไม่มีกลิ่นฉุน\n\nแบบที่ 3 ให้สาร CBD สูง ได้แก่ พันธุ์ตะนาวศรีก้านแดงอาร์ดี 1\nพันธุ์ตะนาวศรีก้านแดงอาร์ดี 1 ... จากการศึกษาค่า Heterozygosity ของพันธุ์กัญชาโดยการเปรียบเทียบข้อมูลจากการศึกษากลุ่มยีน THCAS และ CBDAS พบว่าความแปรผันทางพันธุกรรมของกัญชาพันธุ์นี้ค่อนข้างต่ำเมื่อเทียบกับข้อมูลของกัญชาพันธุ์อื่นๆ ในฐานข้อมูล ดังนั้นรุ่นลูกจะมีความแปรผันทางพันธุกรรมที่ต่ำ และมีโอกาสในการแสดงออกทางด้านเคมีในการสร้างสาร CBD คงที่ จากข้อมูลทางพันธุกรรมที่ได้นำมาเปรียบเทียบกับข้อมูลของปริมาณสาร THC และ CBD ทางด้าน Chemotype พบว่าพันธุ์ตะนาวศรีก้านแดงมีปริมาณสาร CBD สูงซึ่งตรงกับข้อมูลทางด้าน genotype โดยมีปริมาณสาร CBD เฉลี่ยที่ 5.33±0.28 %W/W และค่า ∆9-THC เฉลี่ยที่ 0.26±0.07 %W/W\nตามประวัติพบการแพร่กระจายแถบเทือกเขาตะนาวศรี เทือกเขาถนนธงชัย นอกจากนี้ยังพบการกระจายตัวของพันธุ์นี้ลงไปแถวภาคใต้ของประเทศไทย เช่น แถบจังหวัดนครศรีธรรมราช และตรัง เช่นเดียวกับพันธุ์ตะนาวศรีก้านขาว ลักษณะเด่นของกัญชาพันธุ์ตะนาวศรีก้านแดง คือ มีช่อดอกที่กระจุกแน่นที่ปลายกิ่ง มีช่อดอกจำนวนมากเช่นเดียวกับสายพันธุ์ตะนาวศรีก้านขาว แต่มีลักษณะพิเศษที่แตกต่างคือมีสีแดงที่กิ่ง ก้าน และก้านใบ มีกลิ่นที่หอมหวานคล้ายกลิ่นผลไม้สุก ไม่มีกลิ่นฉุน\n\n และทั้งหมดนี้เป็นเพียงส่วนหนึ่งเท่านั้นสำหรับกัญชาสายพันธุ์ไทยที่ได้รับการขึ้นทะเบียนอย่างถูกต้องตามกฎหมาย ยังมีกัญชาสายพันธุ์ไทยอื่นๆที่ได้รับการขึ้นทะเบียนอีกหลากหลายสายพันธุ์  อย่างไรก็ตาม หากผู้อ่านต้องการรักษาด้วยกัญชาควรศึกษาเรื่องสายพันธุ์กัญชาด้วยนะคะ หรือปรึกษาคลินิกกัญชาได้ทั่วประเทศ เพราะแต่ละสายพันธุ์มีจุดเด่นที่แตกต่างกัน ซึ่งสรรพคุณก็แตกต่างไปด้วยเช่นกัน ส่วนบทความต่อไปจะเป็นเรื่องอะไรนั้น ติดตามได้ทางเว็ปไซด์ไทรทองเราได้เลยค่า ^^'),
    const Content(
        img: 'lib/images/Content3.png',
        title: 'ดูแลสุขภาพวัยทอง ด้วยสมุนไพร',
        txt:'สตรีวัยทอง มักพบในช่วงอายุ 45-55 ปี มักเป็นช่วงใกล้หมดประจำเดือน, ช่วงที่ไม่มีประจำเดือนต่อเนื่องกัน 1 ปี หรือพบได้ในสตรีที่มีการผ่าตัดรังไข่ออกไปทั้งสองข้าง ทำให้สตรีวัยทองเกิดการเปลี่ยนแปลงไป ทั้งด้านร่างกาย และจิตใจ ฉะนั้นหากประจำเดือนมาไม่สม่ำเสมอ อาจเป็นสัญญาณเตือนว่ากำลังเข้าสู่วัยทองในทางแพทย์แผนไทยเมื่อเข้าสู่ช่วงปัจฉิมวัย คือวัยช่วงอายุ 32 ปีเป็นต้นไป (ตามคัมภีร์เวชศาสตร์) จะเป็นช่วงวัยที่มีธาตุลมในร่างกายเด่น ควรระมัดระวังไม่ให้ร่างกายเสียสมดุลของธาตุทั้ง 4 (ดิน น้ำ ลม ไฟ) เพราะอาจทำให้ธาตุลมในร่างกายถูกกระทบได้ง่าย และเกิดอาการเจ็บป่วยตามมา ในทางแผนไทยจึงมีคำเรียกว่า “เลือดจะไป ลมจะมา” แปลความหมายได้ว่า“เลือดจะไป” คือ ต่อมโลหิตระดูจะไม่ทำงานได้เหมือนเดิม หมายถึงการหมดประจำเดือน“ลมจะมา” ช่วงวัยเปลี่ยน ซึ่งเป็นช่วงวัยที่มีธาตุลมเป็นหลัก ซึ่งลมในร่างกายจะถูกกระทบได้ง่าย หากธาตุเสียสมดุล จะมีอาการแตกต่างกันไป ได้แก่ อาการร้อนวูบวาบ(ขี้หนาวขี้ร้อน) ท้องอืด ท้องผูก ผิวแห้งและคัน ปวดเมื่อยตามร่างกาย นอนไม่หลับ ช่องคลอดแห้ง มีการเปลี่ยนสภาพทางจิตใจ เช่น โมโหง่าย ซึมเศร้า ขี้ลืม ใจน้อย เป็นต้น\n\nอาหาร และสมุนไพร ที่เหมาะกับสตรีวัยทอง ได้แก่\n\n1. น้ำมันมะพร้าว\n\nผิวหนังอาจแห้ง และคัน เมื่อฮอร์โมนเพศลดลง สามารถบำรุงผิวด้วยสมุนไพร เช่น ทาน้ำมันมะพร้าวหลังการอาบน้ำ หรือใช้สบู่ที่มีส่วนผสมของสมุนไพรที่ลดอาการคันที่ผิวหนัง เช่น สบู่ขมิ้นชัน สบู่เหงือกปลาหมอn\n\n2. พืชที่มีไฟโตรเอสโตรเจน\n\nเนื่องจากฮอร์โมนเพศลดลง ทำให้ร่างกายควบคุมอุณหภูมิในร่างกายได้ไม่ดีพอ ทำให้เกิดอาการร้อนวูบวาบ โดยเฉพาะกลางคืน ดังนั้นควรรับประทานพืชที่มีไฟโตรเอสโตรเจน ซึ่งคล้ายฮอร์โมนเอสโตรเจน และสารไอโซฟลาโวน(isoflavone) จะช่วยทำให้อาการร้อบวูบวาบลดลง เช่น เต้าหู้เหลือง เต้าเจี้ยว งา แครอท น้ำมะพร้าวn\n\n3. เครื่องดื่มสมุนไพรบำรุงร่างกาย\n\nเครื่องดื่มสมุนไพรบำรุงร่างกาย เช่น น้ำใบเตย น้ำมะตูม น้ำฝาง ชาเกสรบัวหลวง หรือเครื่องดื่มรสเผ็ดร้อนเพื่อทำให้ธาตุลมในร่างกายเดินได้สะดวก เช่น น้ำขิง น้ำตะไคร้\n\n4.สมุนไพรที่มีแคลเซียมสูง\n\nเมื่อเข้าสู่วัยทอง โดยเฉพาะช่วงหมดประจำเดือนไปหลายปี จำมีโอกาสเสี่ยงเรื่องกระดูกบาง ดั้งนั้นควรรับประทานสมุนไพรที่มีแคลเซียมสูง เช่น ยอดแค ยอดใบขี้เหล็ก ยอดสะเดา ผักคะน้า ผักแพว ตำลึง\n\nปรับวิถีชีวิต และพฤติกรรมสุขภาพให้เหมาะสม ได้แก่\n\n1. ละเว้นจากพฤติกรรมที่บั่นทอนสุขภาพ เช่น การสูบบุหรี่ การดื่มแอลกอฮอล์\n\n2. รับประทานอาหารที่มีประโยชน์ครบ 5 หมู่\nลดอาหารประเภทเนื้อสัตว์เพราะเป็นอาหารที่ย่อยยาก ในวัยนี้ประสิทธิภาพการย่อยอาหารจะลดลง จึงควรทานอาหารที่เหมาะสมตามวัย ลดอาหารที่มีรสชาติหวานและมีไขมันสูง เนื่องจากจะทำให้เกิดภาวะหลอดเลือดอุดตันได้ง่ายขึ้น\nเพิ่มอาหารประเภทเส้นใย เช่นผัก ผลไม้(ผลไม้ที่มีน้ำตาลไม่สูง) ซึ่งจะช่วยลดการดูดซึมไขมันและน้ำตาล และยังช่วยให้ขับถ่ายอุจจาระได้ดีขึ้น เป็นการลดความเสี่ยงต่อการเกิดมะเร็งลำไส้ใหญ่\n\nทริค : หากทานเส้นใยมากไป แล้วระหว่างวันดื่มน้ำน้อย จากที่จะทำให้ขับถ่ายสะดวกจะยิ่งทำให้ท้องผูกได้ ฉะนั้นหากทานอาหารที่มีเส้นใยแล้ว หลังตื่นนอนตอนเช้าควรดื่มน้ำ 1แก้วทันที ระหว่างวันควรดื่มน้ำให้เพียงพอต่อร่างกายด้วย จะทำให้ระบบขับถ่ายดีขึ้น\n\n3. ออกกำลังกายเป็นประจำ อย่างน้อยสัปดาห์ละ 3 ครั้ง ครั้งละ 30 นาที\n\n4. พักผ่อนให้เพียงพอและมีกิจกรรมเพื่อคลายเครียดบ้าง ดังคำกล่าวที่ว่า "จิตเป็นนาย...กายเป็นบ่าว" หากจิตใจดี รักษาพลังงานบวกอย่างถูกต้อง ร่างกายก็จะแข็งแรง หรือหากมีอาการเจ็บป่วยก็จะหายได้ง่ายกว่าผู้ที่มีความเครียดสะสม ฉะนั้นเราจึงควรใส่ใจเรื่องสุขภาพจิตใจด้วยนะคะ ^^'),
    const Content(
        img: 'lib/images/Content4.png',
        title: 'รากกิกเก้ ยาสมุนไพรลดอาการไอ ช่วยให้ชุ่มคอ',
        txt:'รากกิกเก้ (Platycodonis glandiflorus) เป็นสมุนไพรแผนจีนหายากที่มีมายาวนาน มีสรรพคุณรักษาโรคได้หลากหลาย ทางแพทย์แผนจีนมักนำมาใช้เป็นส่วนผสมในยาแก้ไอ ขับเสมหะ โดยมีสรรพคุณช่วยบำรุงปอด บรรเทาอาการแน่นหน้าอก และทอนซิลอักเสบ และยังมีการศึกษาที่พบว่า สารซาโปนิน Platycodins ในรากกิกเก้ มีส่วนช่วยคุมอาการของโรคหอบหืด รวมถึงสามารถต้านอนุมูลอิสระ\n\nรากกิกเก้ ของต้นกิกเก้ ขึ้นอยู่ตามพื้นที่ส่วนใหญ่ของจีน ใช้บำบัดอาการไข้หวัดหรือไอเพราะมีเสมหะ โดยเฉพาะมีเสมหะเหนียวขากออกยาก อึดอัดแน่นหน้าอก นอกจากนี้ กิกแก้ยังใช้บำบัดอาการเสียงแหบแห้งเจ็บคอได้ด้วย สำหรับผู้ที่ไอมีเลือดปนหนอง ให้ใช้กิกแก้และชะเอมบำบัด จะช่วยขับเสมหะและหนองได้\n\n'),
    const Content(
        img: 'lib/images/Content5.png',
        title: 'เลือกซื้อให้ถูก “ส่อง ฉลากยาฟ้าทะลายโจร”',
        txt:' ฟ้าทะลายโจร เป็นสมุนไพรธรรมชาติที่มีมานาน มีรสชาติขม จัดอยู่ในกลุ่มยาเย็น มีสรรพคุณ ช่วยบรรเทาอาการหวัด แก้ไอ แก้เจ็บคอ และในช่วงนี้ได้มีโรคระบาดของโควิด19\n\nทำให้นักวิจัยได้ศึกษาเพิ่มเติมเกี่ยวกับสมุนไพรชนิดนี้ โดยพบสาระสำคัญที่ชื่อวา “แอนโดรกราโฟไลค์(andrographolide)” ซึ่งมีฤทธิ์ยับยั้งการเพิ่มจำนวนของไวรัส และ ยังมีส่วนช่วยรักษาอาการของโรคติดเชื้อเฉียบพลันของระบบทางเดินหายใจ เช่นอาการไอ อาการเจ็บคอได้ดี\n\nการรับประทานฟ้าทะลายโจร ควรทานในประมาณที่พอเหมาะ และไม่ควรรับประทานติดต่อกันนานเกิน 3 เดือน เพราะอาจจะทำให้เกิดผลข้างเคียงต่อร่างกายได้ เช่น คลื่นไส้ อาเจียน ปวดท้อง ท้องเสีย เบื่ออาหาร เวียนศีรษะ ใจสั่น หากรับประทานเพื่อรักษาโควิด19 ทั้งแบบแคปซุลหรือแบบเม็ด ควรได้สาร แอนโดรกราโฟไลด์(Andrographolide) 180 มก. หรือประมาณ 3 เม็ด แบ่งเป็น 3 เวลา ก่อนอาหาร และ"ไม่ควรรับประทานติดต่อกันเกิน 5 วันต่อสัปดาห์ "\n\nฟ้าทะลายโจรได้รับการขึ้นทะเบียนเป็นยาสามัญประจำบ้าน จึงสามารถจำหน่ายได้ทั่วไป เช่นเดียวกับยาสามัญประจำบ้าน แต่เมื่อความต้องการยาสมุนไพรชนิดนี้เพิ่มขึ้น ก็เกิดปัญหาคือยาขาดตลาด เปิดช่องว่างให้ผู้ค้าบางรายฉวยโอกาส ปลอมแปลงฉลาก สวม อย. ผลิตยาที่ต่ำกว่ามาตรฐาน หรือขายยาฟ้าทะลายโจรเกินราคา การซื้อฟ้าทะลายโจร ผู้บริโภคต้องตรวจสอบฉลากผลิตภัณฑ์ เพื่อดูปริมาณของสารแอนโดรกราโฟไลด์(Andrographolide) ที่ถูกต้องเหมาะสมกับการบริโภค และที่สำคัญ ให้สังเกตเลขทะเบียน อย. เนื่องจากว่ายาฟ้าทะลายโจรจัดเป็นผลิตภัณฑ์สมุนไพร ฉลากต้องมีเลขทะเบียนขึ้นต้นด้วย “G”'),
  ];

class CT extends StatelessWidget {
  
  @override
  Widget build(BuildContext context) {
    return GridView.builder(
        physics: NeverScrollableScrollPhysics(),
        shrinkWrap: true,
        gridDelegate: SliverGridDelegateWithFixedCrossAxisCount(
            crossAxisCount: 1, mainAxisExtent: 190),
        itemCount: contents.length,
        itemBuilder: (context, index) {
          final content = contents[index];
          return Container(
            margin: const EdgeInsets.all(20),
            decoration: BoxDecoration(
                boxShadow: [
                  BoxShadow(
                      offset: Offset(0, 0),
                      color: Colors.black.withOpacity(.3),
                      blurRadius: 5)
                ],
                color: Color.fromARGB(255, 238, 238, 238),
                borderRadius: BorderRadius.circular(15)),
            child: InkWell(
              onTap: () {
                Navigator.push(context, MaterialPageRoute(builder: (context) => viewContents(contents: content),));
                // int length = contents.length.toInt();
                // if(contents[index]==contents[length-3]){
                //   var conT1 = contents[index+1];
                //   var conT2 = contents[index+2];
                //   var conT3 = contents[0];
                //   var content = contents[index];
                //   Navigator.push(context, MaterialPageRoute(builder: (context) => viewContents(contents: content, conT: [conT1,conT2,conT3]),));
                // }else if(contents[index]==contents[length-2]){
                //   var conT1 = contents[index+1];
                //   var conT2 = contents[0];
                //   var conT3 = contents[1];
                //   Navigator.push(context, MaterialPageRoute(builder: (context) => viewContents(contents: content, conT: [conT1,conT2,conT3]),));
                // }else if(contents[index]==contents[length-1]){
                //   var conT1 = contents[0];
                //   var conT2 = contents[1];
                //   var conT3 = contents[2];
                //   Navigator.push(context, MaterialPageRoute(builder: (context) => viewContents(contents: content, conT: [conT1,conT2,conT3]),));
                // }else{
                //   var conT1 =contents[index+1];
                //   var conT2 =contents[index+2];
                //   var conT3 =contents[index+3];
                //   Navigator.push(context, MaterialPageRoute(builder: (context) => viewContents(contents: content, conT: [conT1,conT2,conT3]),));
                // }  
              },
              child: Row(
                mainAxisAlignment: MainAxisAlignment.center,
                children: [
                  Expanded(
                    child: Container(
                      // height: 150,
                      decoration: BoxDecoration(
                          image: DecorationImage(
                              image: AssetImage(content.img),
                              fit: BoxFit.cover),
                          color: Colors.blue.withOpacity(.3),
                          borderRadius: BorderRadius.only(
                              topLeft: Radius.circular(15),
                              bottomLeft: Radius.circular(15))),
                    ),
                  ),
                  Expanded(
                    child: Padding(
                      padding: const EdgeInsets.all(8.0),
                      child: Column(
                        mainAxisAlignment: MainAxisAlignment.spaceBetween,
                        children: [
                          Container(
                              child: Text(
                            content.title,
                            maxLines: 2,
                            overflow: TextOverflow.ellipsis,
                            style: TextStyle(
                                fontWeight: FontWeight.bold,
                                color: Colors.blue,
                                fontSize: 17),
                          )),
                          Container(
                            margin: const EdgeInsets.all(10),
                            decoration: BoxDecoration(
                                color: Colors.white,
                                borderRadius: BorderRadius.circular(30)),
                            child: Container(
                                padding: const EdgeInsets.all(5),
                                child: Text(
                                  content.txt,
                                  style: TextStyle(color: Colors.blue[400]),
                                  maxLines: 3,
                                  overflow: TextOverflow.ellipsis,
                                  textAlign: TextAlign.center,
                                )),
                          ),
                        ],
                      ),
                    ),
                  ),
                ],
              ),
            ),
          );
        });
  }
}



class Content {
  final img;
  final title;
  final txt;
  const Content({required this.img, required this.title, required this.txt});
}


class viewContents extends StatelessWidget {
  final Content contents;

  viewContents({
    Key? key,
    required this.contents,
  }) : super(key: key);

  @override
  Widget build(BuildContext context) => Scaffold(
    backgroundColor: Color.fromARGB(255, 247, 247, 247),
    appBar: AppBar(
      leading: IconButton(
            onPressed: () {
              Navigator.pop(context);
            },
            icon: Icon(Icons.arrow_back_ios),
          ),
      title: Text(contents.title)),
    body: ListView(children: [
      Container(
        width: double.infinity,
        child: Image(image: AssetImage(contents.img)),
      ),
      Container(
        margin: const EdgeInsets.only(top: 15,left: 15,right: 15),
        child: Text(contents.title,style: TextStyle(fontSize: 20,color: Colors.blue,fontWeight: FontWeight.bold),),
      ),
      Container(
        margin: const EdgeInsets.all(15),
        child: Text(contents.txt),
      ),
      Container(
        height: 1,
        width: 100,
        color: Colors.grey
      ),
      Container(
            margin: const EdgeInsets.only(left: 20,top: 50),
            child: Text(
              'บทความอื่นๆ',
              style: TextStyle(
                  color: Colors.blue,
                  fontWeight: FontWeight.bold,
                  fontSize: 25),
            )),
      CT(),
    ]),
  );
}